Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། མྱ་ངན་ལས་འདས་པ་ནི་སེམས་དང་ལྡན་པ་མ་ཡིན་ཏེ། འདི་ལྟར་འདོད་ཆགས་ཟད་པ་བྱེད་པར་འགྱུར་རོ། ། མྱ་ངན་ལས་འདས་པ་ནི་འདོད་ཆགས་ཟད་པ་སྟེ། དེ་ལྟར་འདོད་ཆགས་ཀྱང་གཞན། མྱ་ངན་ལས་འདས་པ་ཡང་གཞན་ཏེ། གང་གཞན་ཡིན་པ་དེ་ནི་ཕ་རོལ་བས་ཀྱང་ཕ་རོལ་ལོ། ། ཕ་རོལ་བས་ཀྱང་ཕ་རོལ་གང་ཡིན་པ་དེ་ནི་མཁས་པ་རྣམས་ཡོངས་སུ་ཚོལ་ཏེ་ཡོངས་སུ་ཚོལ་བ་ན་སྙིང་པོ་མི་དམིགས་སོ། ། གང་སྙིང་པོ་མེད་པ་དེ་ནི་གསོག་གོ ། གསོག་གང་ཡིན་པ་དེ་ནི་གསོབ་བོ། །གསོབ་གང་ཡིན་པ་དེ་ནི་སྟོང་པའོ། ། ཅིས་སྟོང་ཞེ་ན། བདག་དང་བདག་གི་དང་། རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་དང་། མི་འགྱུར་བའི་ཆོས་ཀྱིས་སྟོང་སྟེ། གང་སེམས་ཅན་མེད་པ་དེ་ནི་སྲོག་མེད་པ་སྟེ། དེ་ལས་འདོད་ཆགས་མི་སྐྱེ་ཞེ་སྡང་མི་སྐྱེ། གཏི་མུག་མི་སྐྱེའོ། །
en: “So it is, Śāriputra, that desire is created by superficial mental activity and manifests due to conceptualization. Without conceptualization, no mental constructs take place. The abandoning of mental constructs is not something that is real, and that which lacks desire is not something that is real. Something that is not real does not suffer and does not experience agony, and something that does not experience agony is not real. Something that is not real has no anguish. This is the way of pacification, nirvāṇa, the state of no desire. How is this the case? Nirvāṇa is not something within the mental sphere. It is that which eliminates desire. Thus, the elimination of desire is defined as nirvāṇa. Desire is one thing, and nirvāṇa is another. That which is other is beyond other things. And that which is beyond other things is what the wise seek. In seeking this they do not apprehend an essence. Something that has no essence is hollow. Something that is hollow is void. Something that is void is empty. What is it empty of? It is empty of a self and of ownership, permanence, stability, constancy, and any unchangeable phenomena. In the absence of a sentient being there is no life force, and consequently no desire arises, no anger arises, and no confusion arises.

source: ཅི་ཡོད་པས་ང་ཞེས་བྱ་བའམ། ངའི་ཞེས་བྱ་བའམ། འདི་ནི་ང་། འདི་ནི་ངའི་འོ་ཞེས་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལོག་པ་འདི་འབྱུང་ཞེ་ན ང་ཡིར་འཛིན་པ་ལས་མངོན་པར་འདུ་བྱེད་པ་འབྱུང་སྟེ། དེ་ལ་མངོན་པར་འདུ་བྱེད་པ་ནི་བཞིའོ། ། བཞི་གང་ཞེ་ན། ལུས་ཀྱིས་མངོན་པར་འདུ་བྱེད་དོ། ། ངག་གིས་མངོན་པར་འདུ་བྱེད་དོ། ། ཡིད་ཀྱིས་བརྟགས་ནས་ངག་རྩུབ་པོ་སྨྲས་ཏེ། དེ་ནས་ཕྱིས་ལུས་ཀྱིས་གནོད་པར་བྱེད་དོ། ། དེ་ལྟར་བདག་དང་གཞན་དུ་འདུ་ཤེས་པ་ལ་འདུ་ཤེས་འཛིན་པར་འགྱུར་རོ། ། ཡང་ཤཱ་རིའི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་འདུ་ཤེས་ཀྱིས་མདུད་པ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་ཕྱིན་ཅི་ལོག་གི་འདུ་ཤེས་འདི་ལྟ་བུ་རིག་ནས་སུ་ཡང་སྟེན་པར་མི་བྱེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟེན་པ་ལས་དེའི་འཇིགས་པ་འབྱུང་སྟེ། བདག་ནི་འཇིགས་པ་མི་འདོད་དོ་ཞེས་ཤཱ་རིའི་བུ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡིད་མི་རྟོན་པ་ཡིན་ནོ། །
en: “Where then does the reversal of the idea of I or mine, of this is me or this is mine, the grasping at a self or the grasping at ownership, take place? Mental conditioning comes from grasping at ownership. Conditions are created in four ways. What are these four ways? One can be conditioned by the bodily. One can be conditioned by the verbal. One might express oneself using harsh language as a result of a mental process and then go on to inflict physical harm. This is how one comes to hold on to the idea of a self and an other. This conceptual knot, Śāriputra, binds all ordinary, immature beings. Śāriputra, as the bodhisatva comes to understand that this is how distortions arise, he does not accommodate anything like this. Why is this? He sees that this kind of accommodation is a danger, and he thinks, ‘I have no interest in such danger.’ As a consequence of this, Śāriputra, the bodhisatva does not make himself reliant on sentient beings.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕ་མར་འདུ་ཤེས་སྐྱེད་ཅེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་ཡུན་རིང་པོའི་དུས་ན་མར་མ་གྱུར་པ་དང་། ཕར་མ་གྱུར་པའི་སེམས་ཅན་གང་ཡང་རྙེད་པར་སླ་བ་མ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཕ་མར་གྱུར་ཏོ། ། དེ་དག་ལ་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་ན་མར་འདུ་ཤེས་པས་སྤོང་ངོ་། ། ཞེ་སྡང་གི་སེམས་སྐྱེས་ན་ཕར་འདུ་ཤེས་པས་སྤོང་སྟེ། ཤཱ་རིའི་བུ་རྣམ་གྲངས་འདིས་ཅི་ནས་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་གཉེན་ཡིན་པར་དེ་ལྟར་རིག་པར་བྱའོ། །
en: “In what way, Śāriputra, does the bodhisatva think of all sentient beings as his mother or his father? Śāriputra, it would be hard to come across a sentient being that has not at some point throughout time been one’s mother or one’s father. All sentient beings have been one’s parents. When desire for them arises, one turns it back by thinking of them as one’s mother, and when anger toward them arises one turns it back by thinking of them as one’s father. This then, Śāriputra, is how the bodhisatva should approach all sentient beings.

source: ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ་ཡངས་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་དུས་དེའི་ཚེ་ན། མཆོག་གི་ཚོགས་ཅན་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ དེ་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུའི་བར་དུ་བཞུགས་སོ། ། དེའི་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུའི་འདུས་པ་ཆེན་པོ་བྱུང་ངོ་། ། ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་རྙེད་ཅེས་བྱ་བ་ཞིག་རྒྱལ་པོའི་རིགས་སུ་སྐྱེས་ཏེ། གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་སྟེ།
en: “At one time in the past, Śāriputra, a great many uncountable, innumerable, inconceivable eons ago, a tathāgata, arhat, fully accomplished buddha by the name of Agragaṇin appeared in the world. He was perfect in wisdom and conduct, he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. He remained in the world for nine hundred million years and had a great following of ninety thousand million billion śrāvakas.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པའི་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ། དེ་བཙས་མ་ཐག་ཏུ་མས་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱིན། ཕས་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱིན། མཛའ་བོ་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་ཀྱིས་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱ་ན། ཕ་མའི་གཉེན་བཤེས་ཀྱིས་ཀྱང་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གཉེན་གྱི་གཡོག་དུ་བྱིན་ནོ། །
en: “At that time, Śāriputra, a bodhisatva by the name of Smṛtipratilabdha was born into a royal family. He was handsome and pleasant to behold, with an abundance of the most supreme features. At his birth, his mother gave him eighty-four thousand servant girls, his father gave him eighty-four thousand servant girls, his friends, relatives, and kinsmen gave him eighty-four thousand servant girls, and his parents’ relations gave him eighty-four thousand servant girls to accompany him and aid him.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཕས་ཁང་པ་གསུམ་བྱེད་དུ་བཅུག་པ་འདི་ལྟ་སྟེ། དཔྱིད་ས་དང་། དབྱར་ས་དང་། དགུན་ས་བྱས་སོ། ། བྱང་ཆུབ་སེམས་དཔའ་དུས་བཞིན་དུ་ཁང་པའི་སྟེང་ན་འདུག་སྟེ། གང་ན་འདུག་པ་དེར་སིལ་སྙན་ཐོགས་པ་བརྒྱ་སྟོང་དུ་མ་འོངས་ནས། བསྙེན་བཀུར་དང་། རིམ་གྲོ་བྱེད་དེ། རོལ་མོའི་སྒྲ་ཕྱུང་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྐྱེ་བ་དང་། འཇིག་པའི་འདུ་ཤེས་སྐྱེས་སོ། ། སྒྲ་འགགས་མ་ཐག་ཏུ་སྒྲ་འདི་ག་ལས་བྱུང་། གང་དུ་བྱུང་། གང་ནས་འགགས། གང་དུ་འགགས་ཞེས་ཡོངས་སུ་ཚོལ་ཏེ། དེ་མཚན་མོའི་འདུ་ཤེས་ཀྱང་མི་སྐྱེ། ཉིན་མོའི་འདུ་ཤེས་ཀྱང་མི་སྐྱེ་ཞིང་། གཞན་དུ་ན་མི་རྟག་པར་འདུ་ཤེས་སྐྱེ་སྟེ། དེ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སྐྱེའོ། །ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་ཐོབ་པ་དེ་ལོ་སྟོང་ཕྲག་བཞི་བཅུར་ནམ་ཡང་ཡིད་རོལ་མོ་ལ་ཆགས་པར་མ་གྱུར་ཏོ། ། ལོ་སྟོང་ཕྲག་བཞི་བཅུར་ནམ་ཡང་འདོད་པ་ལ་མ་སྤྱད་དོ། ། དེ་ཉིད་ན་དེ་ཁྱིམ་ན་གནས་བཞིན་དུ་བསམ་གཏན་བཞི་རྣམས་ལ་བསམ་གཏན་བྱེད་དེ། མངོན་པར་ཤེས་པ་ལྔ་བསྒྲུབས་ནས་དེ་ཁྱིམ་དེ་ནས་རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་བར་སྣང་ལས་བཅོམ་ལྡན་འདས་མཆོག་གི་ཚོགས་ཅན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ག་ལ་བ་དེར་སོང་སྟེ་བཅོམ་ལྡན་འདས་མཆོག་གི་ཚོགས་ཅན་དེ་བཞིན་གཤེགས་པ་ལ་དགེ་བའི་རྩ་བའི་དངོས་པོ་ཅུང་ཟད་ཅིག་ཞུའོ་སྙམ་པ་དང་།
en: “Now, Śāriputra, his father had three palaces made for him: one for the summer, one for the rainy season, and one for the winter. He would reside where the season permitted, and whenever he went from one palace to another, hundreds of thousands of fanfares would accompany him as expressions of honor and reverence. Whenever these instruments were heard, though, the bodhisatva would think only of birth and decay, and when the music stopped he would reflect on how this sound had come about, where it had come from, why it had stopped, and where it had gone to when it ceased. He was not aware of the passage of night and day; he was only aware of impermanence. He did not take any joy in this music. As he did not take any joy in it, Śāriputra, the bodhisatva Smṛtipratilabdha never became attached to these sounds, even after forty thousand years. Even after forty thousand years, he did not take joy in them. Remaining as a householder, he dwelled in the four meditative states and perfected the five superior abilities. Then, from his dwelling, he created a magical emanation and traveled to the place where the tathāgata, arhat, fully accomplished Buddha Agragaṇin was staying in order to ask the Lord, the tathāgata, arhat, fully accomplished Buddha Agragaṇin, about the reality of roots of virtue.

source: ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་མཆོག་གི་ཚོགས་ཅན་དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ཀྱི་ཉིན་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ
en: “However, Śāriputra, the Lord, the Tathāgata Agragaṇin, had stated that the occasion for his final nirvāṇa had arrived.

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དྲུང་དུ་ཕྱིན་ནས་དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ལ་བསྙེན་བཀུར་བགྱིའོ་ཞེས་དྲིས་ན།
en: “So, when the bodhisatva Smṛtipratilabdha arrived there, in the presence of the one who had by then attained nirvāṇa, he asked, ‘Should we mendicants honor the Tathāgata?’

source: དེ་ལ་དགེ་སློང་དེ་དག་ན་རེ་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ་ཞེས་ཟེར་རོ། །
en: “The mendicants then answered, ‘Son of good family, the Tathāgata has attained final nirvāṇa.’

source: དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཞེས་ཐོས་ནས་ས་ཕྱོགས་དེ་ཉིད་དུ་ངུ་ཞིང་བརྒྱལ་ཏེ། ཁ་བུབ་ཏུ་སའི་སྟེང་དུ་འགྱེལ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Upon hearing that Agragaṇin had attained final nirvāṇa, he fell to the earth in tears, and with his face to the ground he spoke these verses:

source: འཇིག་རྟེན་སྒྲོན་མཛད་འདི་ལྟ་བུ། །ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན།
en: “ ‘He was like a light for the world. He had attained mastery in all things.

source: བག་མེད་གནས་སུ་བདག་སོང་བས། །བདག་ཉིད་ཡོངས་སུ་བསླུ་པར་གྱུར། །
en: I have been deceiving myself And have been traveling the road of bewilderment.

source: བསྐལ་པ་བྱེ་བ་ཕྲག་སྟོང་གིས། །དེ་བཞིན་གཤེགས་པ་འབྱུང་འགྱུར་ན། །མགོན་པོ་བདག་གིས་མཉེས་མ་བྱས། །བདག་གི་སྐྱབས་གྱུར་སུ་ཞིག་ཡོད། །
en: “ ‘The tathāgatas appear At intervals of thousands of millions of eons, And as I have not been able to attend a lord, Who will be my protector now?

source: བདག་ལ་སངས་རྒྱས་མ་བརྗོད་པ། །མ་ནི་བདག་གི་དགྲ་ཡིན་སྙམ། །
en: “ ‘My mother seems like an enemy to me For not having told me about the Buddha.

source: སྐྱེས་མ་ཐག་ཏུ་དེ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བལྟ་བ་ཞིག །གང་གིས་འདོད་ལ་བདག་སྦྱར་བ། །ཕ་ནི་བདག་གི་དགྲར་སེམས་ཏེ། །
en: I should have searched for the Tathāgata The moment I was born. “ ‘My father seems like an enemy to me, As he made me engage in pleasures.

source: དེ་དག་དབང་དུ་གྱུར་པས་ན། །འཇིག་རྟེན་མགོན་པོ་མ་མཉེས་བྱས། །
en: I was caught up in them And did not serve the lord of the world.

source: འདི་ལྟར་སངས་རྒྱས་གསུང་སྒྲ་ནི། །ཡན་ལག་དྲུག་ཅུ་བདག་མ་ཐོས། །
en: “ ‘Because of this, I did not hear The speech of the Tathāgata, which has sixty characteristics.

source: བདག་གིས་ངས་རྒྱས་མ་མཉེས་བྱས། །བདག་ལ་ཉམས་པ་ཆེན་པོ་བྱུང་། །
en: My life has been an immense failure, As I have not attended the Buddha.

source: འཇིག་རྟེན་ཕན་མཛད་ཐུགས་བརྩེ་དེ་ལྟ་བུ། །ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན་པ་ནི། །བག་མེད་པ་ཡིས་དེ་རིང་དུས་འདས་ཏེ། །
en: “ ‘He was a tender aid to the world And had reached perfection in everything that is fundamental.

source: རྐང་གཉིས་གཙོ་བོ་བདག་གིས་མ་མཉེས་བྱས། །
en: I, however, have spent my time carelessly And have not attended the supreme among men.

source: བསྐལ་པ་ཁྲག་ཁྲིག་བྱེ་བ་ཕྲག་བརྒྱར་ཡང་། །སངས་རྒྱས་བརྒྱ་ལམ་མཐོང་བ་རྙེད་པར་དཀའ། །
en: “ ‘Even if a thousand million billion eons were to pass, It would be exceedingly difficult to encounter a buddha.

source: བདེ་གཤེགས་མྱ་ངན་འདས་ནས་ཕྱིན་པ་ནི། །རྒྱལ་བ་དེང་འདིར་བདག་གིས་མ་མཉེས་བྱས། །
en: Today, as the Sugata has attained nirvāṇa, I have missed the opportunity to serve him.

source: སྐྱེས་མ་ཐག་ཏུ་སངས་རྒྱས་མ་བརྗོད་པ། །ཕ་དང་མ་ནི་དེ་རིང་དགྲ་ཡིན་སྙམ། །
en: “ ‘My parents are like enemies to me, As they did not immediately tell me about the Buddha.

source: གལ་ཏེ་རྒྱལ་བ་བཞུགས་པ་མཐོང་གྱུར་ན། །ཆོས་རྣམས་ཉན་ཅིང་མཆོད་པ་བྱ་བ་ཞིག
en: If I had had the good fortune to see the Victorious One, I would certainly have honored him and listened to his teachings.

source: བདེ་གཤེགས་མྱ་ངན་འདས་ནས་གདོད་འོངས་པས། །དེ་བཞིན་གཤེགས་པའི་ཡན་ལག་དྲུག་ཅུ་པོ། །དེ་དག་ཀུན་དང་ལྡན་པའི་དབྱངས་འབྱུང་བ། །རྒྱལ་བའི་དེ་དག་བདག་གིས་དེང་མ་ཐོས། །
en: “ ‘The voice of the Tathāgata has sixty characteristics With which its sound carries forth, But I have not had the opportunity to hear his speech today, As the Victorious One has already passed on.

source: མྱ་ངན་འདས་ནས་འདིར་ནི་བདག་ཕྱིན་པ། །དེ་རིང་བདག་ལ་ཉམས་པ་ཆེན་པོ་བྱུང་། །སྔོན་གྱི་སངས་རྒྱས་དག་གིས་རྟག་བསྟན་པ། །གྱ་ནོམ་ཆོས་རྣམས་བདག་ལ་མི་སྟོན་ཏོ། །
en: “ ‘It is a great misfortune that I arrived here today, When nirvāṇa has already been attained, Leaving me with no opportunity to receive the teachings That the buddhas of the past have always revealed.’

source: དེ་ནས་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་ཕྱོགས་དེ་ནས་མྱུར་དུ་ལངས་ཏེ། བཅོམ་ལྡན་འདས་མཆོག་གི་ཚོགས་ཅན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གལ་བ་དེར་སོང་སྟེ་ ཕྱིན་ནས་ དེ་བཞིན་གཤེགས་པའི་ཁྲི་ལ་ངུ་ཞིང་ལན་བརྒྱ་སྟོང་དུ་མ་བསྐོར་བ་བྱས་ནས་ ས་ཕྱོགས་གཅིག་ཏུ་འདུག་སྟེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: “After this, Śāriputra, the bodhisatva got up and proceeded to the deathbed of the Lord, the Tathāgata, the Arhat Agragaṇin, and in tears he circumambulated the Tathāgata’s deathbed many hundreds and thousands of times. He then took his place to one side and spoke these verses:

source: སེམས་ཅན་མཆོག་ནི་ཡང་དག་སྟེ། །ཡང་དག་ཆོས་རྣམས་བསྟན་པ་མཛད། །
en: “ ‘You were truly supreme among sentient beings; The teachings you gave were true.

source: བྱང་ཆུབ་དམ་པ་མཆོག་གི་ཕྱིར། །བདག་གི་སེམས་ནི་ཡང་དག་སྐྱེས། །
en: Now, for the sake of supreme awakening, The mind of truth has arisen in me.

source: ཤེས་རབ་ཆེན་པོ་ཡང་དག་གསུང་། ། དེ་བཞིན་གཤེགས་པ་མི་མཐོང་སྟེ། །
en: “ ‘I am not to see the Tathāgata, The one who speaks truly, the one whose wisdom is great.

source: རྒྱལ་བ་ཁྱོད་ཀྱི་ཅི་འདྲ་བ། །བདག་གི་ཤེས་པའང་དེ་འདྲར་གྱུར། །
en: I hope, though, that my knowledge may become Like that of the Victorious One.

source: བདག་སྔོན་སྟོབས་ཀྱང་ཆུང་བ་སྟེ། །
en: “ ‘Because I was weak willed in the past,

source: ཤེས་རབ་ཞན་པ་བདུད་ཀྱི་ཕྱོགས། །
en: Because I was ignorant on the side of the māras,

source: ཁྱིམ་གྱི་གནས་ན་མཆིས་པས་ན། །
en: Remaining as a householder,

source: མི་ཡི་གཙོ་བོ་མ་མཉེས་བགྱིས། །
en: I did not attend the most superior of men.

source: སྔོན་བགྱིས་བསོད་ནམས་མཆིས་པས་ནི། །དེ་བཞིན་གཤེགས་པ་བདག་གིས་མཐོང་། །
en: “ ‘Because of good deeds performed in the past, I sought out the Tathāgata.

source: ཆོས་རྣམས་བདག་ལ་མི་སྟོན་པས། །དེ་ཕྱིར་ཤིན་ཏུ་སྡུག་བསྔལ་ལོ། །
en: But you could not impart teachings to me— How terrible is the pain this causes me.

source: ལྷ་དང་ཀླུ་ཡི་མདུན་དུ་ནི། །བདེན་པའི་ཚིག་རྣམས་བདག་གིས་བརྗོད། ། ཇི་སྟེ་བདག་ནི་ཡང་དག་ཏུ། །ཇི་སྐད་སྨྲས་པ་བཞིན་གྱུར་ཏེ། །
en: “ ‘May the words of truth that I present In the presence of gods and nāgas Come to be just as I have spoken them, If I am able to pursue what is authentic.

source: མ་འོངས་པ་ཡི་དུས་ཀྱི་ཚེ། །གླང་པོ་ཆེན་པོ་དོན་གཟིགས་པ། །ཡང་དག་ཉིད་ཀྱི་ཆོས་སྟོན་པ། །མི་མཆོག་སངས་རྒྱས་འགྱུར་བར་བགྱི། །
en: “ ‘May I become a buddha In the future, supreme among men, One who sees what is meaningful, a great elephant, One who upholds the true teachings.

source: མི་ཁོམ་པར་ནི་མི་སྐྱེ་ཞིང་། །སྐྱེས་ནས་འདོད་པ་སྟེན་མི་བགྱིད། །བུད་མེད་དངོས་པོར་མི་འགྱུར་ཞིང་། །བདུད་ཀྱི་བཅིངས་པ་གཅད་པར་བགྱི། །
en: “ ‘May I not be born into unfavorable circumstances Or have a life governed by sensual distractions. May I not end up in a female form Or be bound by the chains of Māra.

source: མངོན་སུམ་དུ་ནི་ཆོས་སྟོན་པ། །སངས་རྒྱས་རྣམས་ནི་རྟག་ཏུ་བལྟ། །
en: “ ‘May I always encounter buddhas, So that they can teach me the Dharma directly.

source: མཐོང་ནས་རབ་ཏུ་དད་པར་བགྱི། །དད་ནས་བསྟི་སྟང་རིམ་གྲོ་བགྱི། །
en: May I have faith when I see them And attend them faithfully.

source: བདག་གིས་གང་སྨྲས་ཚིག་འདི་ནི། །ཡང་དག་བདེན་པར་འགྱུར་ཞེ་ན། །བདེན་པ་དེས་ནི་སངས་རྒྱས་འདི། །བྱང་ཆུབ་བཞིན་དུ་བཞུགས་པར་ཤོག །
en: “ ‘May these words that I have spoken Come true in exactly this way, And may this truth establish in me The same awakening as that of the Buddha.

source: ཚིག་འདི་རྣམས་ནི་སྨྲས་པ་དང་། །དེ་བཞིན་གཤེགས་པ་ཅོག་གེར་བཞུགས། ། ལྷ་རྣམས་བྱེ་བ་སྟོང་ཕྲག་གིས། །དེ་ཚེ་རབ་ཏུ་གོས་རབ་གཏོར། །
en: “ ‘Now, as these words have been uttered, Thousands of millions of gods Spread fine fabrics on this seat Where the Tathāgata rests.

source: དེ་ནི་རབ་ཏུ་ཡིད་དགའ་ནས། །བར་སྣང་ལ་ནི་འདུག་གྱུར་ཏེ། ། བར་སྣང་ལ་ནི་འདུག་ནས་སུ། །རྒྱལ་བ་དེ་ལ་ཚིགས་བཅད་བསྟོད། །
en: “ ‘They are gathering in space In joyful celebration, And up above they are singing The praises of the Victorious One.

source: སྣང་བར་གྱུར་པ་ཕན་པའི་ཐུགས། །རྫུ་འཕྲུལ་ཆེན་པོ་དམ་པ་གསུང་། །
en: “ ‘The supreme sayings of the one who possesses great magical abilities Reveal his desire to bring benefit to the world.

source: མཆོག་གི་ཆོས་རྣམས་སྟོན་མཛད་པ། །སངས་རྒྱས་སྨྲ་བ་མགོན་པོ་དྲན། །
en: The protectors remember the words of the Buddha And disseminate his supreme teachings.’

source: དེས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས་འཁོར་རྣམས་རྒྱ་ཆེར་ཚིམ་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “After he had spoken these words, he continued with the following verses in order to put the crowd in good spirits:

source: བདག་ནི་མི་གཙོས་ལུང་བསྟན་ཏེ། །
en: “ ‘It has been prophesied by the supreme among men

source: འཇིག་རྟེན་དུ་ཡང་སངས་རྒྱས་འགྱུར། །
en: That I will become a buddha in this world.

source: བདག་གིས་རྗེས་སུ་སློབ་གྱིས་ལ། །དེ་བཞིན་གཤེགས་ལ་རིམ་གྲོ་གྱིས། །
en: Therefore, follow my example And honor the Tathāgata.

source: བདག་ལ་རྗེས་སུ་ཐུགས་བརྩེའི་ཕྱིར། །མྱ་ངན་འདས་པའང་བཞེངས་གྱུར་ན། །འཇིག་རྟེན་མགོན་པོ་བསམ་མི་ཁྱབ། ། སུ་ཞིག་སངས་རྒྱས་དད་མི་བྱེད། །
en: “ ‘How could I possibly fail to have faith in the Buddha, The inconceivable protector of the world, Who through his great compassion for me Has manifested final nirvāṇa?’

source: དེ་བཞིན་གཤེགས་པ་ལ་དེས་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ་མཆོད་པ་དང་། རིམ་གྲོ་ཆེར་བྱས་ནས་ དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་དེ་ནས་ཤི་འཕོས་པ་དང་། བདེ་འགྲོ་མཐོ་རིས་སུ་སྐྱེས་ཏེ དེ་བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུར་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་། ། བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུར་འདོད་པ་ལ་ནམ་ཡང་ཡོངས་སུ་མ་སྤྱད་དོ། ། བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རབ་ཏུ་འདོད་པའི་ཕྱིར་དེ་དག་ཐམས་ཅད་ལ་ཡང་མཆོད་པ་དང་། རིམ་གྲོ་ཆེར་བྱས་ཏེ་ཐམས་ཅད་དུ་ཡང་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས དེ་བསྐལ་པ་ཐ་མ་དུས་ཐ་མ་ལུས་ཐ་མ་ལ་བདག་གི་དངོས་པོ་ཐ་མ་ཐོབ་པའི་ཚེ་རང་གི་དགེ་བའི་རྩ་བས་བསྐུལ་ནས་ས་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། །ཁ་ལོ་སྒྱུར་བ། བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ས་ལའི་རྒྱལ་པོའི་ཚེའི་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ས་ལའི་རྒྱལ་པོའི་ཉན་ཐོས་འདུས་པ་ནི་གཉིས་བྱུང་སྟེ། ཉན་ཐོས་འདུས་པ་གཅིག་ལ་ནི་དགེ་སློང་བྱེ་བ་ཕྲག་ཉི་ཤུ་ཡོད་དོ། ། ཉན་ཐོས་འདུས་པ་གཉིས་པ་ལ་ནི་དགེ་སློང་སྟོང་ཕྲག་བཞི་བཅུ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་བར་དུའོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རིང་བསྲེལ་ཡང་རྒྱས་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནི་ལོ་སྟོང་ཕྲག་བཅུར་གནས་སོ། །
en: “With this display of roots of virtue, he presented great offerings to the Tathāgata and worshiped him. After his death he was reborn in the joyful heavenly realms because of these roots of virtue. For two hundred million eons, he did not fall into the lower realms. For two hundred million eons he never indulged in the pleasures of the senses. Eager for unsurpassed perfect awakening, he served seven thousand buddhas, presenting all of them with great offerings and worshiping them. He led a life of purity in every way, and in his final eon, in his final birth, in his final existence, his roots of virtue led him to appear in the world as a tathāgata, arhat, fully accomplished buddha by the name of Sālarāja. He was perfect in wisdom and conduct, and he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. Śāriputra, the lord Sālarāja lived for two hundred million years. Śāriputra, the tathāgata Sālarāja had two assemblies of śrāvakas: one assembly of śrāvakas consisting of two hundred million mendicants, and one assembly of śrāvakas consisting of forty thousand mendicants. Every one of them was an arhat who had eliminated their defilements, who was free from vices, who had great abilities, and so forth, and who had reached the very highest level of complete mastery of the mind. After his final nirvāṇa, his relics were distributed widely. After his final nirvāṇa, Śāriputra, the authentic teachings of the tathāgata Sālarāja continued for ten thousand years.”

source: བསྐལ་པ་བྱེ་བ་ཉི་ཤུར་ནི། །ངན་འགྲོར་ནམ་ཡང་མ་སོང་སྟེ། །
en: “For two hundred million eons He did not fall into the lower realms.

source: བསྐལ་པ་བྱེ་བ་ཉི་ཤུར་ཡང་། །འདོད་པ་དག་ལ་ཡོང་མ་བསྟེན། །
en: For two hundred million eons He was not governed by the pleasures of the senses.

source: དེ་ཡི་བར་དུ་སངས་རྒྱས་ནི། །སྟོང་ཕྲག་བདུན་རྣམས་མྱ་ངན་འདས། །དེར་ནི་ཚངས་པར་སྤྱོད་སྤྱད་དེ། །ཆོས་འདོད་པར་ཡང་རྟག་ཏུ་གྱུར། །
en: “During this time, Seven thousand buddhas reached nirvāṇa, And he led a life of purity, Always yearning for the Dharma.

source: དེ་ཕྱིར་བྱང་ཆུབ་སངས་རྒྱས་ནས། །རྒྱལ་བ་སཱ་ལའི་དབང་པོར་གྱུར། །བྱེ་བ་སྟོང་ཕྲག་སུམ་ཅུ་རྣམས། །བྱང་ཆུབ་མཆོག་ལ་རབ་ཏུ་བཀོད། །
en: “Finally, he realized awakening And became the victorious Sālarāja, Dwelling in supreme awakening For thirty thousand years.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་དམ་པ་སངས་རྒྱས་ནས། །བསྐལ་པ་བྱེ་བ་ཉི་ཤུར་ནི། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་བསྟན་ཏོ། །
en: “He realized unsurpassed awakening For the benefit of all who live, And for two hundred million eons He taught the Dharma to living beings.

source: སྟོང་ཕྲག་དག་ནི་བཞི་བཅུ་དང་། །གཞན་ཡང་བྱེ་བ་ཉི་ཤུ་རྙེད། །
en: “He had one saṅgha of forty thousand And another of two hundred million.

source: ཐམས་ཅད་ཟག་ཟད་དྲང་སྲོང་གི། །དགེ་འདུན་དེ་ཚེ་དེ་སྙེད་བྱུང་། །
en: All were sages Who had eliminated the defilements.

source: སྟོན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །རིང་བསྲེལ་ཤིན་ཏུ་རྒྱས་པར་གྱུར། །
en: “After the teacher had attained nirvāṇa, His relics were widely distributed,

source: མཆོད་རྟེན་སྟོང་ཕྲག་དྲུག་ཅུ་དང་། །བྱེ་བ་དག་ཀྱང་དེར་བྱུང་ངོ་། །
en: And six hundred thousand million Stūpas were erected to contain them.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས། །ལོ་ནི་སྟོང་ཕྲག་བཅུར་གནས་ཏེ། །
en: “After his nirvāṇa, His teachings remained for ten thousand years,

source: རྒྱལ་བའི་བསྟན་པ་ཐོས་ནས་ནི། །སུ་ཞིག་དེ་ལ་དད་མི་བྱེད། །
en: And those who heard the Victorious One’s teachings Could not help but develop faith in them.

source: སངས་རྒྱས་ཀྱི་ནི་ཆོས་ཐོས་ནས། ། མཁས་པ་སུ་དག་ནེམ་ནུར་མེད། །
en: “Anyone who is learned will entertain no doubts Once they have heard the teachings of the Buddha.

source: དེ་དག་ངན་འགྲོར་མི་འགྲོ་སྟེ། །མྱུར་དུ་མྱ་ངན་འདས་ལ་རེག །
en: They will not fall into the lower realms But quickly reach nirvāṇa.

source: ཤ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་མ་དང་ཕར་འདུ་ཤེས་སྐྱེད་དེ། འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་པ་ནི་མར་འདུ་ཤེས་པས་སྤོང་ངོ་། ཞེ་སྡང་གི་སེམས་སྐྱེས་པ་ནི་ཕར་འདུ་ཤེས་པས་སྤོང་ངོ་།། །།
en: “So, Śāriputra, the bodhisatva whose morality is pure will regard all sentient beings as his parents. Whenever desire arises in his mind, he neutralizes it by thinking of those he desires as his mother. Whenever hostility arises in his mind, he neutralizes it by thinking of those to whom he feels hostile as his father.
